<?php

namespace App\Domains\Tochnost\Templates\Response;

class SearchOrganizationsExtendedTochnostResponseTemplate
{
    public static array $remoteResponse = [
        'data' => [
            0 => [
                "inn" => "7703477054",
                "logo" => "https://nko.tochno.st/static/nko/images/uploads/heart.png",
                "short_name_visible" => "«Огромное сердце» Ольги Сергеенко",
                "regions" => 55,
                "regions_data" => [
                    [
                        "name" => "Алтайский край"
                    ],
                    [
                        "name" => "Амурская область"
                    ],
                    [
                        "name" => "Астраханская область"
                    ],
                    [
                        "name" => "Белгородская область"
                    ],
                    [
                        "name" => "Брянская область"
                    ],
                    [
                        "name" => "Владимирская область"
                    ],
                    [
                        "name" => "Волгоградская область"
                    ],
                    [
                        "name" => "Вологодская область"
                    ],
                    [
                        "name" => "Воронежская область"
                    ],
                    [
                        "name" => "Забайкальский край"
                    ],
                    [
                        "name" => "Ивановская область"
                    ],
                    [
                        "name" => "Иркутская область"
                    ],
                    [
                        "name" => "Калининградская область"
                    ],
                    [
                        "name" => "Калужская область"
                    ],
                    [
                        "name" => "Камчатский край"
                    ],
                    [
                        "name" => "Кемеровская область"
                    ],
                    [
                        "name" => "Кировская область"
                    ],
                    [
                        "name" => "Костромская область"
                    ],
                    [
                        "name" => "Краснодарский край"
                    ],
                    [
                        "name" => "Красноярский край"
                    ],
                    [
                        "name" => "Курганская область"
                    ],
                    [
                        "name" => "Курская область"
                    ],
                    [
                        "name" => "Ленинградская область"
                    ],
                    [
                        "name" => "Липецкая область"
                    ],
                    [
                        "name" => "Магаданская область"
                    ],
                    [
                        "name" => "Москва"
                    ],
                    [
                        "name" => "Московская область"
                    ],
                    [
                        "name" => "Мурманская область"
                    ],
                    [
                        "name" => "Нижегородская область"
                    ],
                    [
                        "name" => "Новгородская область"
                    ],
                    [
                        "name" => "Новосибирская область"
                    ],
                    [
                        "name" => "Омская область"
                    ],
                    [
                        "name" => "Оренбургская область"
                    ],
                    [
                        "name" => "Орловская область"
                    ],
                    [
                        "name" => "Пензенская область"
                    ],
                    [
                        "name" => "Пермский край"
                    ],
                    [
                        "name" => "Приморский край"
                    ],
                    [
                        "name" => "Псковская область"
                    ],
                    [
                        "name" => "Республика Крым"
                    ],
                    [
                        "name" => "Ростовская область"
                    ],
                    [
                        "name" => "Рязанская область"
                    ],
                    [
                        "name" => "Самарская область"
                    ],
                    [
                        "name" => "Саратовская область"
                    ],
                    [
                        "name" => "Сахалинская область"
                    ],
                    [
                        "name" => "Свердловская область"
                    ],
                    [
                        "name" => "Смоленская область"
                    ],
                    [
                        "name" => "Ставропольский край"
                    ],
                    [
                        "name" => "Тамбовская область"
                    ],
                    [
                        "name" => "Тверская область"
                    ],
                    [
                        "name" => "Томская область"
                    ],
                    [
                        "name" => "Тульская область"
                    ],
                    [
                        "name" => "Ульяновская область"
                    ],
                    [
                        "name" => "Хабаровский край"
                    ],
                    [
                        "name" => "Челябинская область"
                    ],
                    [
                        "name" => "Ярославская область"
                    ]
                ],
                "is_verified" => true,
                "city" => "г Москва",
                "foreign_agent" => 0,
                "ext_info" => [
                    "id" => 308,
                    "image_600" => "600_1594816375_Лого_фонд-01.jpg",
                    "images" => "1594816375_Лого_фонд-01.jpg",
                    "short_description" => "Комплексная помощь взрослым онкобольным и их близким  ",
                    "case_id" => 493,
                    "sum_current" => "742285",
                    "month_sum" => "17540",
                    "count_event" => 8,
                    "name_eng" => "greatheart",
                    "regions" => "РФ",
                    "publications_count" => 1,
                    "subscribers_count" => 192,
                    "case" => []
                ],
            ],
            1 => [
                "inn" => "7813165562",
                "logo" => "https://nko.tochno.st/static/nko/images/uploads/адвита.png",
                "short_name_visible" => "АдВита",
                "regions" => 55,
                "regions_data" => [
                    [
                        "name" => "Алтайский край"
                    ],
                    [
                        "name" => "Амурская область"
                    ],
                    [
                        "name" => "Астраханская область"
                    ],
                    [
                        "name" => "Белгородская область"
                    ],
                    [
                        "name" => "Брянская область"
                    ],
                    [
                        "name" => "Владимирская область"
                    ],
                    [
                        "name" => "Волгоградская область"
                    ],
                    [
                        "name" => "Вологодская область"
                    ],
                    [
                        "name" => "Воронежская область"
                    ],
                    [
                        "name" => "Забайкальский край"
                    ],
                    [
                        "name" => "Ивановская область"
                    ],
                    [
                        "name" => "Иркутская область"
                    ],
                    [
                        "name" => "Калининградская область"
                    ],
                    [
                        "name" => "Калужская область"
                    ],
                    [
                        "name" => "Камчатский край"
                    ],
                    [
                        "name" => "Кемеровская область"
                    ],
                    [
                        "name" => "Кировская область"
                    ],
                    [
                        "name" => "Костромская область"
                    ],
                    [
                        "name" => "Краснодарский край"
                    ],
                    [
                        "name" => "Красноярский край"
                    ],
                    [
                        "name" => "Курганская область"
                    ],
                    [
                        "name" => "Курская область"
                    ],
                    [
                        "name" => "Ленинградская область"
                    ],
                    [
                        "name" => "Липецкая область"
                    ],
                    [
                        "name" => "Магаданская область"
                    ],
                    [
                        "name" => "Москва"
                    ],
                    [
                        "name" => "Московская область"
                    ],
                    [
                        "name" => "Мурманская область"
                    ],
                    [
                        "name" => "Нижегородская область"
                    ],
                    [
                        "name" => "Новгородская область"
                    ],
                    [
                        "name" => "Новосибирская область"
                    ],
                    [
                        "name" => "Омская область"
                    ],
                    [
                        "name" => "Оренбургская область"
                    ],
                    [
                        "name" => "Орловская область"
                    ],
                    [
                        "name" => "Пензенская область"
                    ],
                    [
                        "name" => "Пермский край"
                    ],
                    [
                        "name" => "Приморский край"
                    ],
                    [
                        "name" => "Псковская область"
                    ],
                    [
                        "name" => "Республика Крым"
                    ],
                    [
                        "name" => "Ростовская область"
                    ],
                    [
                        "name" => "Рязанская область"
                    ],
                    [
                        "name" => "Самарская область"
                    ],
                    [
                        "name" => "Саратовская область"
                    ],
                    [
                        "name" => "Сахалинская область"
                    ],
                    [
                        "name" => "Свердловская область"
                    ],
                    [
                        "name" => "Смоленская область"
                    ],
                    [
                        "name" => "Ставропольский край"
                    ],
                    [
                        "name" => "Тамбовская область"
                    ],
                    [
                        "name" => "Тверская область"
                    ],
                    [
                        "name" => "Томская область"
                    ],
                    [
                        "name" => "Тульская область"
                    ],
                    [
                        "name" => "Ульяновская область"
                    ],
                    [
                        "name" => "Хабаровский край"
                    ],
                    [
                        "name" => "Челябинская область"
                    ],
                    [
                        "name" => "Ярославская область"
                    ]
                ],
                "is_verified" => true,
                "city" => "г Санкт-Петербург",
                "foreign_agent" => 0,
                "ext_info" => [
                    "id" => 1,
                    "image_600" => "0",
                    "images" => "",
                    "short_description" => "Помощь детям и взрослым, больным раком",
                    "case_id" => 103,
                    "sum_current" => "82703114.12",
                    "month_sum" => "869321.5",
                    "count_event" => 293,
                    "name_eng" => "advita",
                    "regions" => "Санкт-Петербург",
                    "publications_count" => 80,
                    "subscribers_count" => 7753,
                    "case" => [
                        [
                            "id" => 44,
                            "name" => "Диагностика и жилье для онкологических больных",
                            "name_rod" => "проекта «Поддержка лаборатории НИИ имени Раисы Горбачевой»",
                            "name_dat" => "проекту «Поддержка лаборатории НИИ имени Раисы Горбачевой»",
                            "description" => "Жилье и типирование доноров костного мозга для онкологических пациентов со всей страны",
                            "type" => "ext",
                            "forever" => 1,
                            "path" => "advita",
                            "special" => 0,
                            "closed_at" => null,
                            "foreign_key" => null,
                            "event_count" => 61,
                            "sum_rest" => "714 032",
                            "sum_current" => "231 968",
                            "sum_target" => "946 000",
                            "sum_month" => "231 968",
                            "int_sum" => [
                                "sum_rest" => 714032,
                                "sum_current" => 231968,
                                "sum_target" => 946000,
                                "sum_month" => 231968
                            ],
                            "response_card_type" => "case",
                            "category" => "Медицинская помощь",
                            "category_number" => 2,
                            "link" => "https://takiedela.ru/topics/advita",
                            "image" => "https://takiedela.ru/wp-content/plugins/nuzhnapomosh/image.php?post_id=4382",
                            "text" => "Фонд AdVita оплачивает жилье и типирование доноров костного мозга для онкологических пациентов со всей страны\r"
                        ]
                    ],
                ],
            ],
        ],
    ];

    public static array $outgoingResponse = [
        'data' => [
            0 => [
                "inn" => "7703477054",
                "logo" => "https://nko.tochno.st/static/nko/images/uploads/heart.png",
                "short_name_visible" => "«Огромное сердце» Ольги Сергеенко",
                "regions" => 55,
                "regions_data" => [
                    [
                        "name" => "Алтайский край"
                    ],
                    [
                        "name" => "Амурская область"
                    ],
                    [
                        "name" => "Астраханская область"
                    ],
                    [
                        "name" => "Белгородская область"
                    ],
                    [
                        "name" => "Брянская область"
                    ],
                    [
                        "name" => "Владимирская область"
                    ],
                    [
                        "name" => "Волгоградская область"
                    ],
                    [
                        "name" => "Вологодская область"
                    ],
                    [
                        "name" => "Воронежская область"
                    ],
                    [
                        "name" => "Забайкальский край"
                    ],
                    [
                        "name" => "Ивановская область"
                    ],
                    [
                        "name" => "Иркутская область"
                    ],
                    [
                        "name" => "Калининградская область"
                    ],
                    [
                        "name" => "Калужская область"
                    ],
                    [
                        "name" => "Камчатский край"
                    ],
                    [
                        "name" => "Кемеровская область"
                    ],
                    [
                        "name" => "Кировская область"
                    ],
                    [
                        "name" => "Костромская область"
                    ],
                    [
                        "name" => "Краснодарский край"
                    ],
                    [
                        "name" => "Красноярский край"
                    ],
                    [
                        "name" => "Курганская область"
                    ],
                    [
                        "name" => "Курская область"
                    ],
                    [
                        "name" => "Ленинградская область"
                    ],
                    [
                        "name" => "Липецкая область"
                    ],
                    [
                        "name" => "Магаданская область"
                    ],
                    [
                        "name" => "Москва"
                    ],
                    [
                        "name" => "Московская область"
                    ],
                    [
                        "name" => "Мурманская область"
                    ],
                    [
                        "name" => "Нижегородская область"
                    ],
                    [
                        "name" => "Новгородская область"
                    ],
                    [
                        "name" => "Новосибирская область"
                    ],
                    [
                        "name" => "Омская область"
                    ],
                    [
                        "name" => "Оренбургская область"
                    ],
                    [
                        "name" => "Орловская область"
                    ],
                    [
                        "name" => "Пензенская область"
                    ],
                    [
                        "name" => "Пермский край"
                    ],
                    [
                        "name" => "Приморский край"
                    ],
                    [
                        "name" => "Псковская область"
                    ],
                    [
                        "name" => "Республика Крым"
                    ],
                    [
                        "name" => "Ростовская область"
                    ],
                    [
                        "name" => "Рязанская область"
                    ],
                    [
                        "name" => "Самарская область"
                    ],
                    [
                        "name" => "Саратовская область"
                    ],
                    [
                        "name" => "Сахалинская область"
                    ],
                    [
                        "name" => "Свердловская область"
                    ],
                    [
                        "name" => "Смоленская область"
                    ],
                    [
                        "name" => "Ставропольский край"
                    ],
                    [
                        "name" => "Тамбовская область"
                    ],
                    [
                        "name" => "Тверская область"
                    ],
                    [
                        "name" => "Томская область"
                    ],
                    [
                        "name" => "Тульская область"
                    ],
                    [
                        "name" => "Ульяновская область"
                    ],
                    [
                        "name" => "Хабаровский край"
                    ],
                    [
                        "name" => "Челябинская область"
                    ],
                    [
                        "name" => "Ярославская область"
                    ]
                ],
                "is_verified" => true,
                "city" => "г Москва",
                "foreign_agent" => 0,
                "ext_info" => [
                    "id" => 308,
                    "image_600" => "600_1594816375_Лого_фонд-01.jpg",
                    "images" => "1594816375_Лого_фонд-01.jpg",
                    "short_description" => "Комплексная помощь взрослым онкобольным и их близким  ",
                    "case_id" => 493,
                    "sum_current" => "742285",
                    "month_sum" => "17540",
                    "count_event" => 8,
                    "name_eng" => "greatheart",
                    "regions" => "РФ",
                    "publications_count" => 1,
                    "subscribers_count" => 192,
                    "case" => []
                ],
            ],
            1 => [
                "inn" => "7813165562",
                "logo" => "https://nko.tochno.st/static/nko/images/uploads/адвита.png",
                "short_name_visible" => "АдВита",
                "regions" => 55,
                "regions_data" => [
                    [
                        "name" => "Алтайский край"
                    ],
                    [
                        "name" => "Амурская область"
                    ],
                    [
                        "name" => "Астраханская область"
                    ],
                    [
                        "name" => "Белгородская область"
                    ],
                    [
                        "name" => "Брянская область"
                    ],
                    [
                        "name" => "Владимирская область"
                    ],
                    [
                        "name" => "Волгоградская область"
                    ],
                    [
                        "name" => "Вологодская область"
                    ],
                    [
                        "name" => "Воронежская область"
                    ],
                    [
                        "name" => "Забайкальский край"
                    ],
                    [
                        "name" => "Ивановская область"
                    ],
                    [
                        "name" => "Иркутская область"
                    ],
                    [
                        "name" => "Калининградская область"
                    ],
                    [
                        "name" => "Калужская область"
                    ],
                    [
                        "name" => "Камчатский край"
                    ],
                    [
                        "name" => "Кемеровская область"
                    ],
                    [
                        "name" => "Кировская область"
                    ],
                    [
                        "name" => "Костромская область"
                    ],
                    [
                        "name" => "Краснодарский край"
                    ],
                    [
                        "name" => "Красноярский край"
                    ],
                    [
                        "name" => "Курганская область"
                    ],
                    [
                        "name" => "Курская область"
                    ],
                    [
                        "name" => "Ленинградская область"
                    ],
                    [
                        "name" => "Липецкая область"
                    ],
                    [
                        "name" => "Магаданская область"
                    ],
                    [
                        "name" => "Москва"
                    ],
                    [
                        "name" => "Московская область"
                    ],
                    [
                        "name" => "Мурманская область"
                    ],
                    [
                        "name" => "Нижегородская область"
                    ],
                    [
                        "name" => "Новгородская область"
                    ],
                    [
                        "name" => "Новосибирская область"
                    ],
                    [
                        "name" => "Омская область"
                    ],
                    [
                        "name" => "Оренбургская область"
                    ],
                    [
                        "name" => "Орловская область"
                    ],
                    [
                        "name" => "Пензенская область"
                    ],
                    [
                        "name" => "Пермский край"
                    ],
                    [
                        "name" => "Приморский край"
                    ],
                    [
                        "name" => "Псковская область"
                    ],
                    [
                        "name" => "Республика Крым"
                    ],
                    [
                        "name" => "Ростовская область"
                    ],
                    [
                        "name" => "Рязанская область"
                    ],
                    [
                        "name" => "Самарская область"
                    ],
                    [
                        "name" => "Саратовская область"
                    ],
                    [
                        "name" => "Сахалинская область"
                    ],
                    [
                        "name" => "Свердловская область"
                    ],
                    [
                        "name" => "Смоленская область"
                    ],
                    [
                        "name" => "Ставропольский край"
                    ],
                    [
                        "name" => "Тамбовская область"
                    ],
                    [
                        "name" => "Тверская область"
                    ],
                    [
                        "name" => "Томская область"
                    ],
                    [
                        "name" => "Тульская область"
                    ],
                    [
                        "name" => "Ульяновская область"
                    ],
                    [
                        "name" => "Хабаровский край"
                    ],
                    [
                        "name" => "Челябинская область"
                    ],
                    [
                        "name" => "Ярославская область"
                    ]
                ],
                "is_verified" => true,
                "city" => "г Санкт-Петербург",
                "foreign_agent" => 0,
                "ext_info" => [
                    "id" => 1,
                    "image_600" => "0",
                    "images" => "",
                    "short_description" => "Помощь детям и взрослым, больным раком",
                    "case_id" => 103,
                    "sum_current" => "82703114.12",
                    "month_sum" => "869321.5",
                    "count_event" => 293,
                    "name_eng" => "advita",
                    "regions" => "Санкт-Петербург",
                    "publications_count" => 80,
                    "subscribers_count" => 7753,
                    "case" => [
                        [
                            "id" => 44,
                            "name" => "Диагностика и жилье для онкологических больных",
                            "name_rod" => "проекта «Поддержка лаборатории НИИ имени Раисы Горбачевой»",
                            "name_dat" => "проекту «Поддержка лаборатории НИИ имени Раисы Горбачевой»",
                            "description" => "Жилье и типирование доноров костного мозга для онкологических пациентов со всей страны",
                            "type" => "ext",
                            "forever" => 1,
                            "path" => "advita",
                            "special" => 0,
                            "closed_at" => null,
                            "foreign_key" => null,
                            "event_count" => 61,
                            "sum_rest" => "714 032",
                            "sum_current" => "231 968",
                            "sum_target" => "946 000",
                            "sum_month" => "231 968",
                            "int_sum" => [
                                "sum_rest" => 714032,
                                "sum_current" => 231968,
                                "sum_target" => 946000,
                                "sum_month" => 231968
                            ],
                            "response_card_type" => "case",
                            "category" => "Медицинская помощь",
                            "category_number" => 2,
                            "link" => "https://takiedela.ru/topics/advita",
                            "image" => "https://takiedela.ru/wp-content/plugins/nuzhnapomosh/image.php?post_id=4382",
                            "text" => "Фонд AdVita оплачивает жилье и типирование доноров костного мозга для онкологических пациентов со всей страны\r"
                        ]
                    ],
                ],
            ],
        ],
    ];

    public static array $structureResponse = [
        'data' => [

        ],
    ];
}
