<?php

namespace App\Domains\Sluchaem\Templates\Response;

class CrowdfundingCollectionSluchaemResponseTemplate
{
    public static array $remoteResponse = [
        "status" => true,
        "message" => null,
        "query" => [
            "limit" => "2",
            "offset" => 0,
            "order" => "id",
            "name" => "",
            "category" => "switch array [int,int, ..., int]",
            "type" => "case",
            "exclude" => [
                0
            ],
            "include" => [
                0
            ],
            "count" => 67
        ],
        "alert" => "success",
        "data" => [
            "2_0" => [
                "response_card_type" => "crowdfunding",
                "id" => "2",
                "case_id" => "2",
                "name" => "Такие дела",
                "case_name_rod" => "портала «Такие дела»",
                "case_name_dat" => "порталу «Такие дела»",
                "theme_author" => "Юрий Никулин",
                "link" => "https://takiedela.ru/topics/takie-dela",
                "image" => "https://takiedela.ru/wp-content/uploads/2017/08/td-333x240.jpg",
                "description" => "",
                "full_description" => "На сайте \"Такие дела\" публикуются новости, связанные с социальной проблематикой и благотворительностью.  Также на сайте ежедневно выходит один \"редакционный\" авторский материал и один фандрайзинговый. В этих статьях рассказывается о работе благотворительных фондов, для которых фонд \"Нужна помощь\" собирает деньги. С помощью этих материалов ведется сбор пожертвований на работу этих организаций.\r\n\r\nТакже на сайте публикуются авторские колонки. В разное время для сайта писали Андрей Лошак, Виктор Шендерович, Леонид Парфенов, Андрей Макаревич, Владимир Познер, Андрей Бильжо, Людмила Улицкая, Светлана Ганнушкина, Алексей Кортнев, Юрий Сапрыкин, Светлана Сорокина и многие другие.\r\n<h2>На что нужны деньги</h2>\r\nДеньги нужны на оплату труда штатных сотрудников для создания материалов портала \"Такие дела\", выплату гонораров внештатным авторам и фотографам, аренду офиса и поддержку сайта.\r\n\r\n&nbsp;",
                "short_description" => "На сайте \"Такие дела\" публикуются новости, связанные с социальной проблематикой и благотворительностью.  Также на сайте ежедневно выходит один \"редакционный\" авторский материал и один фандрайзинговый.",
                "type" => "int",
                "category" => [
                    "Поддержка НКО"
                ],
                "category_number" => 2,
                "text" => "На сайте \"Такие дела\" публикуются новости, связанные с социальной проблематикой и благотворительностью.  Также на сайте ежедневно выходит один \"редакционный\" авторский материал и один фандрайзинговый. В этих статьях рассказывается о работе благотворительных фондов, для которых фонд \"Нужна помощь\" собирает деньги. С помощью этих материалов ведется сбор пожертвований на работу этих организаций.\r",
                "sum_rest" => "4 979 043",
                "sum_current" => "2 985 130",
                "sum_target" => "7 964 173",
                "sum_month" => "2 985 130",
                "int_sum" => [
                    "sum_rest" => 4979042.9,
                    "sum_current" => 2985130.1,
                    "sum_target" => 7964173,
                    "sum_month" => 2985130.1
                ],
                "event_count" => 272,
                "path" => "takie-dela",
                "special" => false,
                "forever" => "1",
                "matching" => [
                    "recurrent" => "0",
                    "logo" => null,
                    "name" => "Mironeers Give Back"
                ],
                "foreign" => false
            ],
            "2_1" => [
                "response_card_type" => "crowdfunding",
                "id" => "44",
                "case_id" => "44",
                "name" => "Поддержка лаборатории НИИ им. Р.Горбачевой",
                "case_name_rod" => "проекта «Поддержка лаборатории НИИ имени Раисы Горбачевой»",
                "case_name_dat" => "проекту «Поддержка лаборатории НИИ имени Раисы Горбачевой»",
                "theme_author" => "Юрий Никулин2",
                "link" => "https://takiedela.ru/topics/advita",
                "image" => "https://takiedela.ru/wp-content/uploads/2015/05/advita_laboratorii_NG-333x240.jpg",
                "description" => "благотворительное пожертвование в рамках программы Нужна Помощь",
                "full_description" => "<span style=\"font-weight: 400;\">Трансплантация костного мозга от донора — последний шанс для многих больных с лейкозами, тяжелыми формами анемий, различными опухолями, генетическими заболеваниями. Сама по себе трансплантация — это просто переливание стволовых клеток, которое занимает не больше часа. Но чтобы пересадки стали возможными, необходимо нормальное бесперебойное функционирование многих лабораторий: иногда пациенту делают до десяти анализов в сутки в течение нескольких месяцев. </span>\r\n\r\n<span style=\"font-weight: 400;\">Благотворительный фонд «АдВита» был создан врачами клиники трансплантации костного мозга СПбГМУ и волонтерами в Петербурге в 2002 году. Фонд помогает пациентам с онкологическими, гематологическими, иммунологическими диагнозами (независимо от возраста и прогноза) и онкологическим отделениям федеральных и городских больниц Петербурга, а также лабораториям НИИ ДОГиТ им. Р. Горбачевой ПСПбГМУ им. Павлова.</span>\r\n\r\nПочему лабораториям? Они лишены системного финансирования от государства. Заявки подаются каждый год, но ни одна из них не получила финансирование в полном объеме. Иногда выделенных денег хватает на несколько месяцев, иногда — на пару недель.\r\n\r\n<span style=\"font-weight: 400;\">Людям кажется более правильным помочь конкретному ребенку, нежели жертвовать деньги на реактивы или пробирки. Но если не собрать этих денег, за все исследования придется платить пациентам</span><span style=\"font-weight: 400;\">.</span>\r\n\r\nС 2015 года мы с вами собрали более 31,5 млн. рублей для фонда «АдВита» на работу семи лабораторий НИИ ДОГиТ им. Р. Горбачевой: цитогенетики и диагностики генетических заболеваний, патоморфологии, трансплантологии и молекулярной гематологии, трансплантационной иммунологии, клинической диагностики, криоконсервации с оценкой качества гемопоэтических стволовых клеток, тканевого типирования.\r\n\r\nhttps://www.youtube.com/watch?v=lqxZvL3_G3g\r\n\r\n<span style=\"font-weight: 400;\">Незадолго до завершения этого сбора мы приняли решение продолжить его и сделать </span><b>бессрочным</b><span style=\"font-weight: 400;\">. Теперь мы </span><b>каждый месяц</b><span style=\"font-weight: 400;\"> будем собирать сумму, необходимую для </span><b>одной лаборатории - тканевого типирования</b><span style=\"font-weight: 400;\">. Без ее работы нельзя проводить пересадки костного мозга: именно здесь</span> <span style=\"font-weight: 400;\">проводится проверка тканей на генетическую совместимость у пациентов и их возможных доноров костного мозга, а также типирование пациентов отделения трансплантации почки. В этой же лаборатории проводится исследование на совместимость донорской крови перед ее переливанием пациентам: после</span> <span style=\"font-weight: 400;\">трансплантации костного мозга любой иммунологический конфликт может убить пациента или вызвать тяжелейшие осложнения. Ежегодно лаборатория тканевого типирования НИИ ДОГиТ им. Р. Горбачевой выполняет около 7300 исследований.</span>\r\n<h2>Нас поддерживают</h2>\r\nhttp://www.youtube.com/watch?v=MBKBbSp1XXQ\r\n\r\nhttp://www.youtube.com/watch?v=58pQ7Y015_E\r\n\r\nhttp://www.youtube.com/watch?v=VA_1j9OcOSA\r\n<h2>На что нужны деньги</h2>\r\nДля бесперебойной работы лаборатории нужно 1 100 000 рублей в месяц.\r\nКаждый месяц собранные средства будут направляться на оплату реактивов и расходных материалов, чтобы клиника могла проводить около 250 неродственных трансплантаций костного мозга ежегодно.\r\n\r\n&nbsp;",
                "short_description" => "Трансплантация костного мозга от донора — последний шанс для многих больных с лейкозами, тяжелыми формами анемий, различными опухолями, генетическими заболеваниями. Сама по себе трансплантация — это п",
                "type" => "ext",
                "category" => [
                    "Медицинская помощь"
                ],
                "category_number" => 2,
                "text" => "Трансплантация костного мозга от донора — последний шанс для многих больных с лейкозами, тяжелыми формами анемий, различными опухолями, генетическими заболеваниями. Сама по себе трансплантация — это просто переливание стволовых клеток, которое занимает не больше часа. Но чтобы пересадки стали возможными, необходимо нормальное бесперебойное функционирование многих лабораторий: иногда пациенту делают до десяти анализов в сутки в течение нескольких месяцев. \r",
                "sum_rest" => "906 201",
                "sum_current" => "193 799",
                "sum_target" => "1 100 000",
                "sum_month" => "193 799",
                "int_sum" => [
                    "sum_rest" => 906201,
                    "sum_current" => 193799,
                    "sum_target" => 1100000,
                    "sum_month" => 193799
                ],
                "event_count" => 48,
                "path" => "advita",
                "special" => false,
                "forever" => "1",
                "matching" => [
                    "recurrent" => "0",
                    "logo" => null,
                    "name" => "Mironeers Give Back"
                ],
                "foreign" => false
            ]
        ],
        "count" => null,
        "auth" => null,
        "video" => null,
        "total_sum" => 1750739788.6
    ];

    public static array $fakeResponse = [];

    public static array $structureResponse = [
        "data" => [
            [
                "response_card_type",
                "id",
                "case_id",
                "name",
                "case_name_rod",
                "case_name_dat",
                "theme_author",
                "link",
                "image",
                "description",
                "full_description",
                "short_description",
                "int",
                "category" => [],
                "category_number",
                "text",
                "sum_rest",
                "sum_current",
                "sum_target",
                "sum_month",
                "int_sum" => [
                    "sum_rest",
                    "sum_current",
                    "sum_target",
                    "sum_month"
                ],
                "event_count",
                "path",
                "special",
                "forever",
                "matching" => [
                    "recurrent",
                    "logo",
                    "name"
                ],
                "foreign"
            ],
        ],
        "links" => [
            "first",
            "last",
            "prev",
            "next"
        ],
        "meta" => [
            "current_page",
            "from",
            "last_page",
            "links" => [],
            "path",
            "per_page",
            "to",
            "total"
        ]
    ];
}
