<?php

namespace App\Domains\Sluchaem\Templates\Response;

class FundCollectionSluchaemResponseTemplate
{
    public static array $remoteResponse = [
        "status" => true,
        "message" => null,
        "query" => [
            "limit" => "3",
            "offset" => 0,
            "order" => "id",
            "name" => "",
            "category" => "switch array [int,int, ..., int]",
            "type" => "fund",
            "exclude" => [
                0
            ],
            "include" => [
                0
            ],
            "count" => 321
        ],
        "alert" => "success",
        "data" => [
            "0_1" => [
                "response_card_type" => "fund",
                "id" => "1",
                "name" => "АдВита",
                "name_eng" => "advita",
                "name_case_rod" => "благотворительного фонда AdVita",
                "name_case_dat" => "благотворительному фонду AdVita",
                "name_case" => "АдВита",
                "title" => "НЕКОММЕРЧЕСКАЯ ОРГАНИЗАЦИЯ \"БЛАГОТВОРИТЕЛЬНЫЙ ФОНД \"АДВИТА\"",
                "url" => "http://www.advita.ru/",
                "link" => "https://nuzhnapomosh.ru/funds/advita",
                "region" => "Санкт-Петербург",
                "regions_for_help" => "Санкт-Петербург",
                "description" => "",
                "fest_description" => "",
                "touch_description" => "<p>&nbsp;</p>\n<p>Благотворительный фонд AdVita помогает пациентам с&amp;nbsp;онкологическими, гематологическими, иммунологическими диагнозами и&amp;nbsp;онкологическим отделениям федеральных и&amp;nbsp;городских больниц Петербурга. Главный принцип работы Фонда&amp;nbsp;&amp;mdash; любой человек, независимо от&amp;nbsp;уровня доходов, возраста, национальности, места жительства, медицинского прогноза, должен получить самое современное лечение. Фонд оплачивает лекарства, обследования, поиск донора костного мозга в&amp;nbsp;российском и&amp;nbsp;международном регистрах, обеспечивает иногородних подопечных жильем, оказывает материальную и&amp;nbsp;социальную помощь семьям пациентов.</p>\n<p>Онкологические и&amp;nbsp;гематологические больные во&amp;nbsp;время эпидемии коронавирусной инфекции находятся в&amp;nbsp;зоне повышенного риска. К&amp;nbsp;сожалению, на&amp;nbsp;данный момент многие медицинские учреждения Петербурга не&amp;nbsp;обеспечены средствами индивидуальной защиты для медицинского персонала. Поэтому одна из&amp;nbsp;первейших задач фонда сейчас&amp;nbsp;&amp;mdash; обеспечить врачей СИЗ, чтобы минимизировать риск их&amp;nbsp;заражения и&amp;nbsp;распространения заражения на&amp;nbsp;пациентов. Фонд AdVita оказывает помощь четырем клиникам в&amp;nbsp;Петербурге, три из&amp;nbsp;которых федеральные. Кроме того, фонд обеспечивает средствами индивидуальной защиты и&amp;nbsp;средствами дезинфекции самих пациентов, а&amp;nbsp;также организует регулярное тестирование подопечных на&amp;nbsp;COVID-19. Важно также отметить, что начались перебои с&amp;nbsp;поставкой жизненно важных для онкологических больных препаратов, в&amp;nbsp;том числе иммуноглобулинов. Их&amp;nbsp;активно начали использовать для лечения больных коронавирусной инфекцией. Поэтому еще одна задача&amp;nbsp;&amp;mdash; отслеживать появление препаратов и&amp;nbsp;оперативно выкупать&amp;nbsp;их, чтобы лечение больных раком людей не&amp;nbsp;прерывалось</p>\n<p>В&amp;nbsp;рамках акции, на&amp;nbsp;собранные средства будет закуплен препарат Октагам.&nbsp;</p>",
                "full_description" => "<p><span lang=\"RU\">Благотворительный фонд AdVita создан врачами клиники трансплантации костного мозга СПбГМУ им. И.П. Павлова и волонтером Павлом Гринбергом в Санкт-Петербурге в 2002 году. Фонд помогает пациентам с онкологическими, гематологическими, иммунологическими диагнозами (независимо от возраста и прогноза) и онкологическим отделениям федеральных и городских больниц Петербурга.&nbsp;</span>Главный принцип работы Фонда &mdash; любой человек независимо от уровня доходов, возраста, национальности, места жительства, медицинского прогноза должен получить самое современное лечение. Фонд оплачивает лекарства, обследования, поиск донора костного мозга в российском и международном регистре, обеспечивает иногородних подопечных жильем, оказывает материальную и социальную помощь семьям пациентов.</p>\n<p>Отчеты:</p>\n<div><a href=\"https://takiedela.ru/otchet-fonda-advita-za-4-kv-2020/\" target=\"_blank\" rel=\"noopener\">Отчет за 4 квартал 2020 года</a></div>\n<div><a href=\"https://takiedela.ru/otchet-fonda-advita-za-3-kv-2020/\" target=\"_blank\" rel=\"noopener\">Отчет за 3 квартал 2020 года</a></div>\n<div><a href=\"https://takiedela.ru/otchet-fonda-advita-za-2-kv-2020/\" target=\"_blank\" rel=\"noopener\">Отчет за 2 квартал 2020 года</a></div>\n<div><a href=\"https://takiedela.ru/otchet-fonda-advita-za-1kv-2020/\" target=\"_blank\" rel=\"noopener\">Отчет за 1 квартал 2020 года</a></div>\n<div><a href=\"https://takiedela.ru/otchet-fonda-advita-za-chetvertyy-kva/\" target=\"_blank\" rel=\"noopener\">Отчет за 4 квартал 2019 года</a></div>\n<div><a href=\"https://takiedela.ru/otchet-advita-za-tretiy-kvarta/\" target=\"_blank\" rel=\"noopener\">Отчет за 3 квартал 2019 года</a></div>\n<div><a href=\"https://takiedela.ru/otchet-fonda-advita-za-pervoe-polugo/\" target=\"_blank\" rel=\"noopener\">Отчет за 1 полугодие 2019 года</a></div>",
                "short_description" => "Помощь детям и взрослым, больным раком",
                "director" => "Гринберг Павел Вадимович",
                "phone" => "7 (921) 9636243",
                "email" => "info@advita.ru",
                "image" => "/img/funds/1.png",
                "image_300" => "0",
                "image_600" => "0",
                "count_case" => 1,
                "count_event" => 265,
                "count_array" => [
                    "fund" => 262,
                    "case" => 48
                ],
                "case" => [
                    0 => [
                        "response_card_type" => "case",
                        "id" => "44",
                        "name" => "Поддержка лаборатории НИИ им. Р.Горбачевой",
                        "name_case_rod" => "проекта «Поддержка лаборатории НИИ имени Раисы Горбачевой»",
                        "name_case_dat" => "проекту «Поддержка лаборатории НИИ имени Раисы Горбачевой»",
                        "description" => "благотворительное пожертвование в рамках программы Нужна Помощь",
                        "type" => "ext",
                        "category" => "Медицинская помощь",
                        "category_number" => 2,
                        "image" => "https://takiedela.ru/wp-content/plugins/nuzhnapomosh/image.php?post_id=4382",
                        "text" => "Трансплантация костного мозга от донора — последний шанс для многих больных с лейкозами, тяжелыми формами анемий, различными опухолями, генетическими заболеваниями. Сама по себе трансплантация — это просто переливание стволовых клеток, которое занимает не больше часа. Но чтобы пересадки стали возможными, необходимо нормальное бесперебойное функционирование многих лабораторий: иногда пациенту делают до десяти анализов в сутки в течение нескольких месяцев. \r",
                        "link" => "https://takiedela.ru/topics/advita",
                        "sum_rest" => "907 731",
                        "sum_current" => "192 269",
                        "sum_target" => "1 100 000",
                        "sum_month" => "192 269",
                        "int_sum" => [
                            "sum_rest" => 907731,
                            "sum_current" => 192269,
                            "sum_target" => 1100000,
                            "sum_month" => 192269
                        ],
                        "event_count" => 48,
                        "path" => "advita",
                        "special" => false,
                        "close" => null,
                        "foreign" => false
                    ]
                ],
                "case_id" => "103",
                "category" => [
                    "Дети",
                    "Подростки",
                    "Взрослые"
                ],
                "status" => "active",
                "tag" => "touch",
                "estimate" => "",
                "flags" => null,
                "forever" => "0",
                "matching" => [
                    "recurrent" => "0",
                    "logo" => null,
                    "name" => "Mironeers Give Back"
                ],
                "foreign" => false,
                "sum_rest" => "74 376 599",
                "sum_current" => "74 376 599"
            ],
            "0_2" => [
                "response_card_type" => "fund",
                "id" => "2",
                "name" => "Аистенок",
                "name_eng" => "aistenok",
                "name_case_rod" => "общественной организации «Аистенок»",
                "name_case_dat" => "общественной организации «Аистенок»",
                "name_case" => "Аистенок",
                "title" => "СВЕРДЛОВСКАЯ РЕГИОНАЛЬНАЯ ОБЩЕСТВЕННАЯ ОРГАНИЗАЦИЯ ПО СОДЕЙСТВИЮ СЕМЬЯМ С ДЕТЬМИ В ТРУДНОЙ ЖИЗНЕННОЙ СИТУАЦИИ \"АИСТЕНОК\"",
                "url" => "http://www.aistenok.org/",
                "link" => "https://nuzhnapomosh.ru/funds/aistenok",
                "region" => "Екатеринбург",
                "regions_for_help" => "Свердловская область",
                "description" => "",
                "fest_description" => "",
                "touch_description" => "<p>МОО &laquo;Аистенок&raquo; работает с 3 июня 2003 года, почти 17 лет. Помогает семьям с детьми, попавшим в трудную жизненную ситуацию (профилактика отказов, предотвращение изъятия детей из семей с целью сохранения детей в родных семьях; сопровождение приемных семей, работа с детьми-отказниками на территории детских больниц; кризисные отделения для женщин с детьми, группы дневного пребывания, услуги Социального склада, благотворительный магазин; работа со Следственным комитетом, судами и т.д.).На попечении находятся около 400 семей (Екатеринбург, города Свердловской области, г. Ишим Тюменской области).</p>\n<p>Любой гражданин в трудной жизненной ситуации. В зависимости от ситуации (после письма на сайт, звонка по телефону, прихода в офис) с семьей (человеком) ведется очное/он-лайн консультирование с выяснением глубины кризиса и принимается решение (о заселении в кризисное жилье, о прохождении реабилитации, о посещении психолога, о предоставлении продуктовой/гуманитарной помощи. На 10 мая ровно в половину&nbsp; увеличилось количество новых обращений в организацию за разного рода помощью. Люди (особенно люди с детьми) наиболее часто попадают в безвыходную ситуацию, лишаются работы из-за закрытия ДОУ и невозможности оставить ребенка одного дома. Звонки каждый день, более 30- 50 писем ежедневно на сайт и в группах ВК, инстаграмм.&nbsp;</p>\n<p>В рамках акции организация поможет 30 подопечным продуктовыми наборами (состав: чай,тушенка,гречка, пшено, рис, мука, масло и.т.д) , 50 подопечным наборами хозяйственных товаров( состав: порошок,жидкое мыло, зубная паста, средства для мытья посуды и.т.д) и лекарствами (обезболивающие, жаропонижающие, противовирусные препараты)&nbsp;&nbsp;</p>",
                "full_description" => "<p>Организация &laquo;Аистенок&raquo; основана в 2003 году.</p>\n<p><strong>Задачи:</strong> Сопровождение семей с детьми (родными и приемными) с тяжелым материальным положением ,содействие устройству в новые семьи детей-сирот и детей, оставшихся без попечения родителей, предотвращение отказов от детей.</p>\n<p><strong>Проекты:</strong></p>\n<p>- Будем вместе (Профилактическая работа&nbsp;с женщинами, попавшими в трудную жизненную ситуацию)</p>\n<p>- Социальный склад (Сбор вещей для семей, оказавшихся в трудной жизненной ситуации. Ежемесячно на социальный склад обращаются в среднем 145 семей в кризисной ситуации)</p>\n<p>- Здравствуй, малыш (В городе Екатеринбург действует постоянная&nbsp; служба для работы с отказными детьми на территориях детских больниц. Специалисты службы помогают детям сохранить &nbsp;&nbsp;психоэмоциональное и физическое здоровье)</p>\n<p>- Кризисное отделение для женщин с маленькими детьми (Создание условий для временного проживания&nbsp; женщин с маленькими детьми до урегулирования трудной жизненной ситуации в семье. Квартира рассчитана на проживание 5 семей единовременно. Период проживания обговаривается индивидуально из расчета трудности ситуации и составляет от 1 до 12 месяцев)</p>\n<p>- Семейный центр в Дегтярске (Строительство центра временного проживания для женщин с маленькими детьми. Ежегодно центр сможет приютить 25-50 семей и помочь женщинам пережить кризисную жизненную ситуацию, чтобы остаться вместе со своим ребенком)</p>\n<p><strong>Результаты:</strong></p>\n<p>- При поддержке специалистов организации 137&nbsp;мам&nbsp;аннулировали отказ&nbsp;от ребенка</p>\n<p>- 495 детей-сирот обрели приемную семью</p>\n<p>- &laquo;Аистенок&raquo; постоянно сопровождает 600 семей &ndash; это приемные семьи, одинокие мамы, семьи в трудной жизненной ситуации.</p>\n<p><strong>Отчеты:</strong></p>\n<div><a href=\"https://takiedela.ru/otchet-aistenok-za-4-kv-2020/\">Отчет организации &laquo;Аистенок&raquo; за 4 квартал 2020 года</a></div>\n<div><a href=\"https://takiedela.ru/otchet-aistenok-za-3-kv-2020/\">Отчет организации &laquo;Аистенок&raquo; за 3 квартал 2020 года</a></div>\n<div><a href=\"https://takiedela.ru/otchet-aistenok-za-2kv-2020/\">Отчет организации &laquo;Аистенок&raquo; за 2 квартал 2020 года</a></div>\n<div><a href=\"https://takiedela.ru/otchet-aistenok-za-1kv-2020/\">Отчет организации &laquo;Аистенок&raquo; за 1 квартал 2020 года</a></div>\n<div><a href=\"https://takiedela.ru/otchet-aistenok-4kv/\">Отчет организации &laquo;Аистенок&raquo; за 4 квартал 2019 года</a></div>\n<div><a href=\"https://takiedela.ru/otchet-aistenok-tret-kv/\">Отчет организации &laquo;Аистенок&raquo; за 3 квартал 2019 года</a></div>\n<div><a href=\"https://takiedela.ru/otchet-organizacii-aistenok-za-pervo/\">Отчет организации &laquo;Аистенок&raquo; за 1 полугодие 2019 года</a></div>",
                "short_description" => "Помощь семьям в трудной жизненной ситуации, профилактика сиротства",
                "director" => "Лазарева Лариса Владимировна",
                "phone" => "7 (343) 371-02-53",
                "email" => "osipova-alla@mail.ru",
                "image" => "/img/funds/2.png",
                "image_300" => "0",
                "image_600" => "0",
                "count_case" => 2,
                "count_event" => 50,
                "count_array" => [
                    "fund" => 31,
                    "case" => 30
                ],
                "case" => [
                    0 => [
                        "response_card_type" => "case",
                        "id" => "92",
                        "name" => "Территория семьи",
                        "name_case_rod" => "проекта «Территория семьи»",
                        "name_case_dat" => "проекту «Территория семьи»",
                        "description" => "Благотворительное пожертвование в рамках программы Нужна помощь",
                        "type" => "ext",
                        "category" => "Дети-сироты",
                        "category_number" => 2,
                        "image" => "https://takiedela.ru/wp-content/plugins/nuzhnapomosh/image.php?post_id=42372",
                        "text" => "Принято считать, что от детей отказываются только асоциальные матери, у которых проблемы с алкоголем и наркотиками. На деле все не так. В группу риска попадают многодетные и малообеспеченные одинокие мамы; женщины, потерявшие во время беременности мужа; юные мамы, не уверенные в том, что смогут вырастить ребенка самостоятельно.\r",
                        "link" => "https://takiedela.ru/topics/territoriya-semi",
                        "sum_rest" => "0",
                        "sum_current" => "2 936 305",
                        "sum_target" => "2 867 608",
                        "sum_month" => "0",
                        "int_sum" => [
                            "sum_rest" => 0,
                            "sum_current" => 2936305,
                            "sum_target" => 2867608,
                            "sum_month" => 0
                        ],
                        "event_count" => 30,
                        "path" => "territoriya-semi",
                        "special" => false,
                        "close" => "2019-12-24 13:12:00",
                        "foreign" => false
                    ],
                    1 => [
                        "response_card_type" => "case",
                        "id" => "508",
                        "name" => "Социальный склад в Екатеринбурге",
                        "name_case_rod" => "проекта «Социальный склад в Екатеринбурге»",
                        "name_case_dat" => "проекту «Социальный склад в Екатеринбурге»",
                        "description" => "Предотвратить социальное сиротство, поддержать малообеспеченные семьи, не дать им скатиться за черту бедности",
                        "type" => "int",
                        "category" => "Кризисные семьи",
                        "category_number" => 2,
                        "image" => "https://takiedela.ru/wp-content/plugins/nuzhnapomosh/image.php?post_id=206196",
                        "text" => "По данным Росстата Свердловской области, доход каждого десятого жителя в регионе не дотягивает до прожиточного минимума, люди находятся за чертой бедности и число бедных стремительно растет. Весной из-за пандемии и вынужденной самоизоляции закрылись малые производства, разорились многие компании, сервисы, детские учреждения. Безработица наступает. И самыми уязвимыми в этой ситуации оказываются одинокие родители, многодетные и малообеспеченные семьи.\r",
                        "link" => "https://takiedela.ru/topics/socialnyy-sklad-v-ekaterinburge",
                        "sum_rest" => "855 784",
                        "sum_current" => "201 676",
                        "sum_target" => "1 057 460",
                        "sum_month" => "10 010",
                        "int_sum" => [
                            "sum_rest" => 855784,
                            "sum_current" => 201676,
                            "sum_target" => 1057460,
                            "sum_month" => 10010
                        ],
                        "event_count" => 0,
                        "path" => "socialnyy-sklad-v-ekaterinburge",
                        "special" => false,
                        "close" => null,
                        "foreign" => false
                    ]
                ],
                "case_id" => "104",
                "category" => [
                    "Дети",
                    "Взрослые"
                ],
                "status" => "active",
                "tag" => "touch, help",
                "estimate" => "",
                "flags" => null,
                "forever" => "0",
                "matching" => [
                    "recurrent" => "0",
                    "logo" => null,
                    "name" => "Mironeers Give Back"
                ],
                "foreign" => false,
                "sum_rest" => "8 029 614",
                "sum_current" => "8 029 614"
            ],
        ],
        "count" => null,
        "auth" => null,
        "video" => null,
        "total_sum" => 1750160564.6
    ];

    public static array $fakeResponse = [];

    public static array $structureResponse = [
        "data" => [
            0 => [
                "response_card_type",
                "id",
                "name",
                "name_eng",
                "inn",
                "name_case_rod",
                "name_case_dat",
                "name_case",
                "title",
                "url",
                "link",
                "region",
                "regions_for_help",
                "description",
                "fest_description",
                "touch_description",
                "full_description",
                "short_description",
                "director",
                "phone",
                "email",
                "image",
                "image_300",
                "image_600",
                "count_case",
                "count_event",
                "count_array" => [
                    "fund",
                    "case"
                ],
                "case" => [
                    0 => [
                        "response_card_type",
                        "id",
                        "name",
                        "name_case_rod",
                        "name_case_dat",
                        "description",
                        "type",
                        "category",
                        "category_number",
                        "image",
                        "text",
                        "link",
                        "sum_rest",
                        "sum_current",
                        "sum_target",
                        "sum_month",
                        "int_sum" => [
                            "sum_rest",
                            "sum_current",
                            "sum_target",
                            "sum_month"
                        ],
                        "event_count",
                        "path",
                        "special",
                        "close",
                        "foreign"
                    ]
                ],
                "case_id",
                "category" => [],
                "status",
                "tag",
                "estimate",
                "flags",
                "forever",
                "matching" => [
                    "recurrent",
                    "logo",
                    "name"
                ],
                "foreign",
                "sum_rest",
                "sum_current"
            ]
        ],
        "links" => [
            "first",
            "last",
            "prev",
            "next"
        ],
        "meta" => [
            "current_page",
            "from",
            "last_page",
            "links" => [],
            "path",
            "per_page",
            "to",
            "total"
        ]
    ];
}
